Repository: rmraya/XLIFFManager
Catalog: XliffManager_*.xlf
Languages: es

# CheckURL.0=
source: OpenXLIFF Server ready
es: Servidor OpenXLIFF listo

# FilterServer.0=
source: Version: {0} Build: {1}
es: Versión: {0} Compilación: {1}

# FilterServer.1=
source: OpenXLIFF Server error
es: Error de Servidor OpenXLIFF

# FilterServer.2=
source: OpenXLIFF Server started
es: Servidor OpenXLIFF iniciado

# FilterServer.3=
source: OpenXLIFF Server closed
es: Servidor OpenXLIFF cerrado

# XliffHandler.0=
source: Error retrieving result from server
es: Error al recuperar el resultado del servidor

# XliffHandler.1=
source: Unable to create skeleton folder {0}
es: No se puede crear la carpeta de esqueleto {0}

# XliffHandler.2=
source: Error creating skeleton
es: Error al crear esqueleto

# XliffHandler.3=
source: Auto-detected type: {0}
es: Tipo detectado automáticamente: {0}

# XliffHandler.4=
source: Unable to auto-detect file format
es: No se puede detectar automáticamente el formato de archivo

# XliffHandler.5=
source: Auto-detected encoding: {0}
es: Codificación detectada automáticamente: {0}

# XliffHandler.6=
source: Unable to auto-detect character set
es: No se puede detectar automáticamente el juego de caracteres

# XliffHandler.7=
source: Selected file is valid XLIFF {0}
es: El archivo seleccionado es XLIFF {0} válido

# XliffHandler.8=
source: Validation completed
es: Validación completada

# XliffHandler.9=
source: Error validating file
es: Error al validar el archivo

# XliffHandler.10=
source: Error getting target file
es: Error al obtener el archivo de destino
