Repository: rmraya/XLIFFManager
Catalog: docs/xliffmanager.ditamap.xlf
Languages: es

source: Translation Tasks
es: Traducciones

source: Use the options in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Translation Tasks</uicontrol> panel to:
es: Utilice las opciones del panel <uicontrol class="+ topic/ph ui-d/uicontrol ">Traducciones</uicontrol> para:

source: Copy Source to all Untranslated Segments
es: Copiar origen a destino en todos los segmentos no traducidos

source: Pseudo-Translate Untranslated Segments
es: Pseudo-traducir segmentos no traducidos

source: Remove all Targets
es: Eliminar todas las traducciones

source: Approve all Segments
es: Aprobar Todos los Segmentos

source: Translation Tasks
es: Traducciones

source: With XLIFF Manager you can create <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> files from the following document formats:
es: Con XLIFF Manager puede crear archivos <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> a partir de los siguientes formatos de documento:

source: Trados Studio Packages
es: Paquetes de Trados Studio

source: SRT Subtitles
es: Subtítulos SRT

source: XLIFF from Other Tools (*.mqxliff, *.xliff)
es: XLIFF de otras herramientas (*.mqxliff, *.xliff)

source: XML (Generic)
es: XML (Genérico)

source: Java Properties
es: Propiedades de Java

source: RC (Windows C/C++ Resources)
es: RC (Recursos de Windows C/C++)

source: ResX (Windows .NET Resources)
es: ResX (Recursos de Windows .NET)

source: TS (Qt Linguist translation source)
es: TS (Fuente de Traducción de Qt Linguist)

source: Introduction
es: Introducción

source: XLIFF Manager provides an open source UI for <xref href="https://github.com/rmraya/OpenXLIFF" scope="external" class="- topic/xref " format="html">OpenXLIFF Filters</xref>, a set of programs that let you:
es: XLIFF Manager proporciona una interfaz de usuario de código abierto para <xref href="https://github.com/rmraya/OpenXLIFF" scope="external" class="- topic/xref " format="html">OpenXLIFF Filters</xref>, un conjunto de programas que le permiten:

source: Convert your translated XLIFF files to original format with a couple of clicks.
es: Convertir sus archivos XLIFF traducidos al formato original con un par de clics.

source: Validate XLIFF files created by any tool. Validation is supported for XLIFF 1.0, 1.1, 1.2 and 2.0.
es: Validar archivos XLIFF creados por cualquier herramienta. La validación es compatible con XLIFF 1.0, 1.1, 1.2 y 2.0.

source: Character Set
es: Juego de Caracteres

source: On the left panel, click on the <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/stats.png" placement="inline" class="- topic/image "/> Analyse XLIFF</uicontrol> option.
es: En el panel izquierdo, haga clic en la opción <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/stats.png" placement="inline" class="- topic/image "/> Analizar XLIFF</uicontrol>.

source: Type the name and location of the XLIFF file to analyse in the <uicontrol class="+ topic/ph ui-d/uicontrol ">XLIFF File</uicontrol> text box or click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea analizar en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo XLIFF</uicontrol> o haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Analyse XLIFF</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Analizar XLIFF</uicontrol>.

source: Approve all Segments
es: Aprobar Todos los Segmentos

source: Some translation tools do not offer a way to confirm segments at translation time. Use this feature to confirm all segments, so you can select the <uicontrol class="+ topic/ph ui-d/uicontrol ">Export Approved Segments as TMX</uicontrol> option when using the <xref href="merge_xliff.dita" class="- topic/xref ">Merge XLIFF File</xref> option.
es: Algunas herramientas de traducción no ofrecen una forma de confirmar segmentos en el momento de la traducción. Utilice esta función para confirmar todos los segmentos, de modo que pueda seleccionar la opción <uicontrol class="+ topic/ph ui-d/uicontrol ">Exportar segmentos aprobados como TMX</uicontrol> cuando utilice la opción <xref href="merge_xliff.dita" class="- topic/xref ">Combinar XLIFF</xref>.

source: On the left panel, click on the <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/tasks.png" placement="inline" class="- topic/image "/> Translation Tasks</uicontrol> option.
es: En el panel izquierdo, haga clic en la opción <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/tasks.png" placement="inline" class="- topic/image "/> Traducciones</uicontrol>.

source: Type the name and location of the XLIFF file to process in the <uicontrol class="+ topic/ph ui-d/uicontrol ">XLIFF File</uicontrol> text box or click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea procesar en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo XLIFF</uicontrol> o haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Approve all Segments</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Aprobar Todos los Segmentos</uicontrol>.

source: Copy Source to all Untranslated Segments
es: Copiar origen a destino en todos los segmentos no traducidos

source: Copy the content of <codeph class="+ topic/ph pr-d/codeph "><source></codeph> elements to new or existing empty <codeph class="+ topic/ph pr-d/codeph "><target></codeph> elements in an XLIFF file.
es: Copiar el contenido de los elementos <codeph class="+ topic/ph pr-d/codeph "><source></codeph> a los elementos <codeph class="+ topic/ph pr-d/codeph "><target></codeph> que estén vacíos, creando nuevos elementos de ser necesario, en un archivo XLIFF.

source: On the left panel, click on the <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/tasks.png" placement="inline" class="- topic/image "/> Translation Tasks</uicontrol> option.
es: En el panel izquierdo, haga clic en la opción <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/tasks.png" placement="inline" class="- topic/image "/> Traducciones</uicontrol>.

source: Type the name and location of the XLIFF file to process in the <uicontrol class="+ topic/ph ui-d/uicontrol ">XLIFF File</uicontrol> text box or click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea procesar en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo XLIFF</uicontrol> o haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Copy Source to Target</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Copiar origen a Destino</uicontrol>.

source: Create XLIFF File
es: Crear Archivo XLIFF

source: Use the <i class="+ topic/ph hi-d/i ">Create XLIFF</i> panel to generate an <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> file from a selected document.
es: Utilice el panel <i class="+ topic/ph hi-d/i ">Crear XLIFF</i> para generar un archivo <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> a partir de un documento seleccionado.

source: Create XLIFF File
es: Crear Archivo XLIFF

source: On the left panel, click the <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/plus.png" placement="inline" class="- topic/image "/> Create XLIFF</uicontrol> option.
es: En el panel izquierdo, haga clic en la opción <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/plus.png" placement="inline" class="- topic/image "/> Crear XLIFF</uicontrol>.

source: Type the name and location of the document to convert to XLIFF in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Source File</uicontrol> text box or click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button next to it to select a document from the file system.
es: Escriba el nombre y la ubicación del documento que desea convertir a XLIFF en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo de origen</uicontrol> o haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> junto a él para seleccionar un documento del sistema de archivos.

source: If you use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to select a file, the program tries to automatically guess its file type and character set.
es: Si utiliza el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionar un archivo, el programa intenta adivinar automáticamente su tipo de archivo y juego de caracteres.

source: Select the language of the document to convert using the <uicontrol class="+ topic/ph ui-d/uicontrol ">Source Language</uicontrol> drop-down list.
es: Seleccione el idioma del documento que desea convertir mediante la lista desplegable <uicontrol class="+ topic/ph ui-d/uicontrol ">Idioma de origen</uicontrol>.

source: Optionally, select the language of the translated document using the <uicontrol class="+ topic/ph ui-d/uicontrol ">Target Language</uicontrol> drop-down list.
es: Opcionalmente, seleccione el idioma del documento traducido mediante la lista desplegable <uicontrol class="+ topic/ph ui-d/uicontrol ">Idioma de destino</uicontrol>.

source: Select or adjust the type of source document using the <uicontrol class="+ topic/ph ui-d/uicontrol ">File Type</uicontrol> drop-down list.
es: Seleccione o ajuste el tipo de documento de origen mediante la lista desplegable <uicontrol class="+ topic/ph ui-d/uicontrol ">Tipo de archivo</uicontrol>.

source: Select or adjust the <xref href="../glossaries/character_set.dita" class="- topic/xref ">character set</xref> of the source document using the <uicontrol class="+ topic/ph ui-d/uicontrol ">Character Set</uicontrol> drop-down list.
es: Seleccione o ajuste el <xref href="../glossaries/character_set.dita" class="- topic/xref ">juego de caracteres</xref> del documento de origen mediante la lista desplegable <uicontrol class="+ topic/ph ui-d/uicontrol ">Juego de caracteres</uicontrol>.

source: If you are converting a JSON document and need to use a custom configuration file, enter its name and location in the <uicontrol class="+ topic/ph ui-d/uicontrol ">JSON Configuration</uicontrol> text box or use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button next to it to select a file from the file system.
es: Si está convirtiendo un documento JSON y necesita usar un archivo de configuración personalizado, escriba su nombre y ubicación en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Configuración de JSON</uicontrol> o use el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> junto a él para seleccionar un archivo del sistema de archivos.

source: Information on configuration files for the JSON filter is available at <xref href="https://github.com/rmraya/OpenXLIFF/tree/master/src/com/maxprograms/converters/json#readme" scope="external" class="- topic/xref " format="html">https://github.com/rmraya/OpenXLIFF/tree/master/src/com/maxprograms/converters/json#readme</xref>
es: La información sobre los archivos de configuración para el filtro JSON está disponible en <xref href="https://github.com/rmraya/OpenXLIFF/tree/master/src/com/maxprograms/converters/json#readme" scope="external" class="- topic/xref " format="html">https://github.com/rmraya/OpenXLIFF/tree/master/src/com/maxprograms/converters/json#readme</xref>

source: Select the <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate XLIFF 2.0</uicontrol> check box if you want to generate XLIFF 2.0.
es: Active la casilla <uicontrol class="+ topic/ph ui-d/uicontrol ">Generar XLIFF 2.0</uicontrol> si desea generar XLIFF 2.0.

source: The program generates XLIFF 1.2 by default.
es: El programa genera XLIFF 1.2 de forma predeterminada.

source: Select the <uicontrol class="+ topic/ph ui-d/uicontrol ">Paragraph Segmentation</uicontrol> check box if you want source text to be segmented at paragraph level.
es: Active la casilla <uicontrol class="+ topic/ph ui-d/uicontrol ">Segmentar por párrafos</uicontrol> si desea que el texto de origen se segmente en el nivel de párrafo.

source: The program uses sentence-level segmentation by default. You can select the default <xref href="../glossaries/SRX.dita" class="- topic/xref ">SRX</xref> file used for segmentation in the <xref href="default_settings.dita" class="- topic/xref ">Settings</xref> dialog.
es: El programa utiliza la segmentación a nivel de oración por defecto. Puede seleccionar el archivo <xref href="../glossaries/SRX.dita" class="- topic/xref ">SRX</xref> predeterminado utilizado para la segmentación en el cuadro de diálogo <xref href="default_settings.dita" class="- topic/xref ">Configuración</xref>.

source: Select the <uicontrol class="+ topic/ph ui-d/uicontrol ">Embed Skeleton</uicontrol> option if you want the skeleton file to be inserted in the generated XLIFF.
es: Seleccione la opción <uicontrol class="+ topic/ph ui-d/uicontrol ">Incrustar esqueleto</uicontrol> si desea que el archivo esqueleto se inserte en el XLIFF generado.

source: The program generates a separated skeleton file in the folder defined in <xref href="default_settings.dita" class="- topic/xref ">Settings</xref> dialog. An embedded skeleton allows merging the XLIFF file in any computer, not just the one where the XLIFF was generated.
es: El programa genera un archivo esqueleto separado en la carpeta definida en el cuadro de diálogo <xref href="default_settings.dita" class="- topic/xref ">Configuración</xref>. Un esqueleto incrustado permite combinar el archivo XLIFF en cualquier computadora, no solo en aquella donde se generó el archivo XLIFF.

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Create XLIFF</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Crear XLIFF</uicontrol>.

source: The program generates an XLIFF file and the corresponding skeleton.
es: El programa genera un archivo XLIFF y el esqueleto correspondiente.

source: Settings
es: Configuración

source: Use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Settings</uicontrol> dialog to set the default languages used by the application and to configure the main XML catalog and default folder used to store skeletons when creating <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> files.
es: Utilice el cuadro de diálogo <uicontrol class="+ topic/ph ui-d/uicontrol ">Configuración</uicontrol> para establecer los idiomas predeterminados utilizados por la aplicación y para configurar el catálogo XML principal y la carpeta predeterminada utilizada para almacenar esqueletos al crear archivos <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref>.

source: On the left panel, click the
es: En el panel izquierdo, haga clic en la opción

source: Settings</uicontrol> option or select <menucascade class="+ topic/ph ui-d/menucascade "> <uicontrol class="+ topic/ph ui-d/uicontrol ">File</uicontrol> <uicontrol class="+ topic/ph ui-d/uicontrol ">Settings</uicontrol> </menucascade> in main menu (<menucascade class="+ topic/ph ui-d/menucascade "> <uicontrol class="+ topic/ph ui-d/uicontrol ">XLIFF Manager</uicontrol> <uicontrol class="+ topic/ph ui-d/uicontrol ">Preferences</uicontrol> </menucascade> on macOS).
es: Configuración</uicontrol> o seleccione <menucascade class="+ topic/ph ui-d/menucascade "> <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo</uicontrol> <uicontrol class="+ topic/ph ui-d/uicontrol ">Configuración</uicontrol> </menucascade> en el menú principal ( <menucascade class="+ topic/ph ui-d/menucascade "> <uicontrol class="+ topic/ph ui-d/uicontrol ">XLIFF Manager</uicontrol> <uicontrol class="+ topic/ph ui-d/uicontrol ">Preferencias...</uicontrol> </menucascade> en macOS).

source: The following dialog appears:
es: Aparece el siguiente cuadro de diálogo:

source: Settings Dialog
es: Cuadro de diálogo Configuración

source: Select the apropriate default source and target languages to use when creating XLIFF files.
es: Seleccione los idiomas de origen y destino predeterminados apropiados que desea utilizar al crear archivos XLIFF.

source: If you wish to use a custom catalog for XML files, enter its location in the <uicontrol class="+ topic/ph ui-d/uicontrol ">System Catalog</uicontrol> text box or use the corresponding <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to select it from the file system.
es: Si desea utilizar un catálogo personalizado para archivos XML, introduzca su ubicación en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Catálogo del sistema</uicontrol> o utilice el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionarlo del sistema de archivos.

source: To use a custom <xref href="../glossaries/SRX.dita" class="- topic/xref ">SRX</xref> file when creating XLIFF files, enter its location in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Default SRX File</uicontrol> text box or use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to select it from the file system.
es: Para utilizar un archivo <xref href="../glossaries/SRX.dita" class="- topic/xref ">SRX</xref> personalizado al crear archivos XLIFF, introduzca su ubicación en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo SRX predeterminado</uicontrol> o utilice el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionarlo del sistema de archivos.

source: Use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Application Language</uicontrol> drop-down to select the language used in XLIFF Manager graphical user interface.
es: Utilice el menú desplegable <uicontrol class="+ topic/ph ui-d/uicontrol ">Idioma de la aplicación</uicontrol> para seleccionar el idioma utilizado en la interfaz gráfica de usuario de XLIFF Manager.

source: Changes to the application language will take effect after you restart the program.
es: Los cambios en el idioma de la aplicación surtirán efecto después de reiniciar el programa.

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Save Settings</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Guardar Configuración</uicontrol>.

source: Merge XLIFF File
es: Combinar Archivo XLIFF

source: Use the <i class="+ topic/ph hi-d/i ">Merge XLIFF</i> panel to convert an <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> file to original format.
es: Utilice el panel <i class="+ topic/ph hi-d/i ">Combinar XLIFF</i> para convertir un archivo <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> al formato original.

source: XLIFF Manager can only merge XLIFF files that it generated or XLIFF files created with other tools that use <i class="+ topic/ph hi-d/i ">OpenXLIFF Filters</i>.
es: XLIFF Manager solo puede combinar archivos XLIFF que generó o archivos XLIFF creados con otras herramientas que utilizan <i class="+ topic/ph hi-d/i ">OpenXLIFF Filters</i>.

source: Merge XLIFF File
es: Combinar Archivo XLIFF

source: On the left panel, click on the <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/merge.png" placement="inline" class="- topic/image "/> Merge XLIFF</uicontrol> option.
es: En el panel izquierdo, haga clic en la opción <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/merge.png" placement="inline" class="- topic/image "/> Combinar XLIFF</uicontrol>.

source: Type the name and location of the XLIFF file to merge in the <uicontrol class="+ topic/ph ui-d/uicontrol ">XLIFF File</uicontrol> text box or click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button next to it to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea combinar en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo XLIFF</uicontrol> o haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionar un archivo XLIFF del sistema de archivos.

source: If you use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to locate the XLIFF file, the program tries to automatically generate a suitable target file or folder.
es: Si utiliza el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para localizar el archivo XLIFF, el programa intenta generar automáticamente un archivo o carpeta de destino adecuado.

source: If the XLIFF file contains multiple documents inside, a folder is required to place all translated files in it. This is usually the case when the XLIFF was created from a DITA Map.
es: Si el archivo XLIFF contiene varios documentos en su interior, se requiere una carpeta para guardar los documentos traducidos. Este suele ser el caso cuando el archivo XLIFF se creó a partir de un mapa DITA.

source: Select the <uicontrol class="+ topic/ph ui-d/uicontrol ">Accept Unapproved Segments</uicontrol> checkbox if you want to consider all segments as translated, even when the <xmlatt class="+ topic/keyword markup-d/markupname xml-d/xmlatt ">approved</xmlatt> attribute is not set to "yes".
es: Seleccione la casilla de verificación <uicontrol class="+ topic/ph ui-d/uicontrol ">Aceptar segmentos no aprobados</uicontrol> si desea considerar todos los segmentos como traducidos, incluso cuando el atributo "<xmlatt class="+ topic/keyword markup-d/markupname xml-d/xmlatt ">approved</xmlatt>" no esté establecido en "yes".

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Merge XLIFF</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Combinar XLIFF</uicontrol>.

source: XLIFF Manager merges the indicated file.
es: XLIFF Manager combina el archivo indicado.

source: Pseudo-Translate Untranslated Segments
es: Pseudo-traducir segmentos no traducidos

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Pseudo-Translate</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Pseudo-Traducir</uicontrol>.

source: Remove all Targets
es: Eliminar todas las traducciones

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Remove all Targets</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Eliminar Todas las Traducciones</uicontrol>.

source: Validate XLIFF
es: Validar XLIFF

source: XLIFF Manager can validate <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> 1.0, 1.1, 1.2 and 2.0.
es: XLIFF Manager puede validar <xref href="../glossaries/XLIFF.dita" class="- topic/xref ">XLIFF</xref> 1.0, 1.1, 1.2 y 2.0.
