Repository: rmraya/XLIFFManager
Catalog: docs/xliffmanager.ditamap.xlf
Languages: es

source: Validating XLIFF against XML grammars (DTD or XML Schemas) is not enough. XML Schema validation does not detect the use of duplicated 'id' attributes, wrong language codes and other constraints written in the different XLIFF specifications.
es: Validar XLIFF con gramáticas XML (DTD o esquemas XML) no es suficiente. La validación usand esquema XML no detecta el uso de atributos 'id' duplicados, códigos de idioma incorrectos y otras restricciones escritas en las diferentes especificaciones XLIFF.

source: In addition to validating all XLIFF 2.0 modules using XML Schema validation, extra validation is performed for XLIFF 2.0 Core and for Metadata, Matches and Glossary modules.
es: Además de validar todos los módulos XLIFF 2.0 mediante la validación de esquemas XML, se realiza una validación adicional para XLIFF 2.0 Core y para los módulos Metadata, Matches y Glossary.

source: Validate XLIFF File
es: Validar Archivo XLIFF

source: On the left panel, click on the <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/check.png" placement="inline" class="- topic/image "/> Validate XLIFF</uicontrol> option.
es: En el panel izquierdo, haga clic en la opción <uicontrol class="+ topic/ph ui-d/uicontrol "><image href="../images/check.png" placement="inline" class="- topic/image "/> Validar XLIFF</uicontrol>.

source: Type the name and location of the XLIFF file to validate in the <uicontrol class="+ topic/ph ui-d/uicontrol ">XLIFF File</uicontrol> text box or click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Browse...</uicontrol> button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea validar en el cuadro de texto <uicontrol class="+ topic/ph ui-d/uicontrol ">Archivo XLIFF</uicontrol> o haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Examinar...</uicontrol> para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the <uicontrol class="+ topic/ph ui-d/uicontrol ">Validate XLIFF</uicontrol> button.
es: Haga clic en el botón <uicontrol class="+ topic/ph ui-d/uicontrol ">Validar XLIFF</uicontrol>.

source: XLIFF Manager validates the indicated file.
es: XLIFF Manager valida el archivo indicado.

source: <ph class="- topic/ph ">XLIFF Manager User Guide</ph> <image href="images/openxliff.png" placement="break" class="- topic/image " scale="80"/> </mainbooktitle> <booktitlealt class="- topic/ph bookmap/booktitlealt "> <ph class="- topic/ph ">Copyright © 2018-2023 Maxprograms</ph>
es: <ph class="- topic/ph ">Guía del Usuario de XLIFF Manager</ph> <image href="images/openxliff.png" placement="break" class="- topic/image " scale="80"/> </mainbooktitle> <booktitlealt class="- topic/ph bookmap/booktitlealt "> <ph class="- topic/ph "> Derechos de autor © 2018-2023 Maxprograms</ph>

source: Creating and Merging XLIFF Files
es: Crear y Combinar Archivos XLIFF
