Repository: rmraya/XLIFFManager
Catalog: docs/XLIFF/xliffmanager_*.ditamap.xlf
Languages: es

source: Subscriptions
es: Suscripciones

source: Source code of XLIFF Manager is free. Anyone can download the source code from {ph0}Github.com{ph1}, compile, modify and use it at no cost in compliance with the accompanying license terms.
es: El código fuente de XLIFF Manager es gratuito. Cualquiera puede descargar el código fuente de {ph0}Github.com{ph1}, compilarlo, modificarlo y utilizarlo sin coste alguno respetando los términos de la licencia adjunta.

source: Developing and maintaining a software project takes time, effort and resources. That is why we offer subscriptions for support services such as technical assistance, bug fixes, and feature requests. By subscribing to our support plan, you not only get access to our expertise and help, but you also contribute to the continuous improvement of XLIFF Manager. Your subscription fees help us pay for code development and ensure the quality and reliability of our software.
es: Desarrollar y mantener un proyecto de software requiere tiempo, esfuerzo y recursos. Por eso ofrecemos suscripciones a servicios de asistencia técnica, corrección de errores y solicitud de funciones. Al suscribirse a nuestro plan de asistencia, no sólo tendrá acceso a nuestra experiencia y ayuda, sino que también contribuirá a la mejora continua de XLIFF Manager. Su suscripción nos ayuda a pagar el desarrollo del código y a garantizar la calidad y fiabilidad de nuestro software.

source: Subscription Keys are available at {ph0}Maxprograms Online Store{ph1}. Subscription Keys cannot be shared or transferred to different machines.
es: Las claves de suscripción están disponibles en la {ph0}tienda en línea de Maxprograms{ph1}. Las claves de suscripción no se pueden compartir ni transferir a otras máquinas.

source: Subscriptions include direct email support at {ph0}tech@maxprograms.com{ph1}
es: Las suscripciones incluyen soporte por correo electrónico directo en {ph0}tech@maxprograms.com{ph1}

source: Register a Subscription Key
es: Registrar Clave de Suscripción

source: When you run the program without a registered subscription, the bottom of the screen shows a {ph0}Register Subscription{ph1} link.
es: Cuando ejecuta el programa sin una suscripción registrada, en la parte inferior de la pantalla aparece un enlace {ph0}Registrar Suscripción{ph1}.

source: In main menu, select {ph0} {ph1}Help{ph2} {ph3}Register Subscription{ph4} {ph5} or click the {ph6}Register Subscription{ph7} link displayed at the bottom of the screen.
es: En el menú principal, seleccione {ph0} {ph1}Ayuda{ph2} {ph3}Registrar Suscripción{ph4} {ph5} o haga clic en el enlace {ph6}Registrar Suscripción{ph7} que aparece en la parte inferior de la pantalla.

source: The {ph0}Subscription Management{ph1} dialog appears: {ph2}
es: El cuadro de diálogo {ph0}Manejo de Suscripciones{ph1} aparece: {ph2}

source: {ph0}Subscription Management{ph1} dialog
es: Cuadro de diálogo {ph0}Manejo de Suscripciones{ph1}

source: If you have a subscription key, type it in the {ph0}Subscription Key{ph1} text box and click the {ph2}Register Subscription{ph3} button.
es: Si tiene una clave de suscripción, escríbala en el cuadro de texto {ph0}Clave de Suscripción{ph1} y haga clic en el botón {ph2}Registrar Suscripción{ph3}.

source: If you don't have a Subscrition Key and wish to purchase one, click the {ph0}Purchase Subscription{ph1} button to open {ph2}Maxprograms Online Store{ph3} in your default web browser.
es: Si no tiene una clave de suscripción y desea comprar una, haga click en el botón {ph0}Comprar Suscripción{ph1} para abrir la {ph2}tienda en línea de Maxprograms{ph3} en su navegador web predeterminado.

source: Translation Tasks
es: Traducciones

source: Use the options in the {ph0}Translation Tasks{ph1} panel to:
es: Utilice las opciones del panel {ph0}Traducciones{ph1} para:

source: Copy Source to all Untranslated Segments
es: Copiar origen a destino en todos los segmentos no traducidos

source: Pseudo-Translate Untranslated Segments
es: Pseudo-traducir Segmentos no Traducidos

source: Remove all Targets
es: Eliminar todas las traducciones

source: Approve all Segments
es: Aprobar todos los segmentos

source: Translation Tasks
es: Traducciones

source: Supported File Formats
es: Tipos de Archivo Compatibles

source: With XLIFF Manager you can create {ph0}XLIFF{ph1} files from the following document formats:
es: Con XLIFF Manager puede crear archivos {ph0}XLIFF{ph1} a partir de los siguientes tipos de documentos:

source: General Documentation
es: Documentación General

source: Adobe InDesign IDML CS4, CS5, CS6 & CC
es: Adobe InDesign IDML CS4, CS5, CS6 y CC

source: Microsoft Office (2007 and newer)
es: Microsoft Office (2007 y versiones posteriores)

source: Microsoft Visio XML Drawings (2007 and newer)
es: Dibujos XML de Microsoft Visio (2007 y versiones posteriores)

source: Plain Text
es: Texto sin Formato

source: QTI Packages
es: Paquetes QTI

source: SRT Subtitles
es: Subtítulos SRT

source: Localization Files
es: Archivos de Localización

source: Trados Studio Packages (*.sdlppx)
es: Paquetes Trados Studio (*.sdlppx)

source: Wordfast/GlobalLink TXML (*.txml)
es: TXML de Wordfast/GlobalLink (*.txml)

source: Wordfast/GlobalLink XLIFF (*.txlf)
es: XLIFF de Wordfast/GlobalLink (*.txlf)

source: WPML XLIFF (WordPress Multilingual Plugin)
es: XLIFF de WPML (WordPress Multilingual Plugin)

source: XLIFF from Other Tools (*.mqxliff, *.xliff)
es: XLIFF de otras herramientas (*.mqxliff, *.xliff)

source: XML Formats
es: Formatos XML

source: XML (Generic)
es: XML (Genérico)

source: DITA 1.0, 1.1, 1.2 and 1.3
es: DITA 1.0, 1.1, 1.2 y 1.3

source: DocBook 3.x, 4.x and 5.x
es: DocBook 3.x, 4.x y 5.x

source: Software Development
es: Desarrollo de Software

source: Java Properties
es: Propiedades de Java

source: RC (Windows C/C++ Resources)
es: RC (Recursos de Windows C/C++)

source: ResX (Windows .NET Resources)
es: ResX (Recursos de Windows .NET)

source: The XML filter is customizable. Users can define conversion rules for almost any XML vocabulary. Instructions for configuring the XML filter are available on GitHub, at {ph0}XLIFF Filter Configuration Files{ph1}.
es: El filtro XML es personalizable. Los usuarios pueden definir reglas de conversión para casi cualquier vocabulario XML. Las instrucciones para configurar el filtro XML están disponibles en GitHub, en {ph0}XLIFF Filter Configuration Files{ph1}.

source: The JSON filter supports user-defined configuration files. Instructions for writing configuration files are available on GitHub, at {ph0}JSON Filter Configuration Files{ph1}.
es: El filtro JSON admite archivos de configuración definidos por el usuario. Las instrucciones para escribir archivos de configuración están disponibles en GitHub, en {ph0}JSON Filter Configuration Files{ph1}.

source: Introduction
es: Introducción

source: XLIFF Manager provides an open source UI for {ph0}OpenXLIFF Filters{ph1}, a set of programs that let you:
es: XLIFF Manager proporciona una interfaz de usuario de código abierto para {ph0}OpenXLIFF Filters{ph1}, un conjunto de programas que le permiten:

source: Create {ph0}XLIFF{ph1} 1.2, 2.0, 2.1 and 2.2 files that can be translated in any modern {ph2}CAT{ph3} tool.
es: Cree archivos {ph0}XLIFF{ph1} 1.2, 2.0, 2.1 y 2.2 que se pueden traducir en cualquier herramienta {ph2}TAO{ph3} moderna.

source: Convert your translated XLIFF files to original format with a couple of clicks.
es: Convertir sus archivos XLIFF traducidos al formato original con un par de clics.

source: Validate XLIFF files created by any tool. Validation is supported for XLIFF 1.0, 1.1, 1.2 and 2.0.
es: Validar archivos XLIFF creados por cualquier herramienta. La validación es compatible con XLIFF 1.0, 1.1, 1.2 y 2.0.

source: Produce an HTML file with word counts and segment status statistics from an XLIFF document.
es: Generar un archivo HTML con conteos de palabras y estadísticas de estado de segmentos a partir de un documento XLIFF.

source: XLIFF Manager GUI
es: Interfaz de usuario de XLIFF Manager

source: Supported Platforms
es: Plataformas Compatibles

source: XLIFF Manager works on these Operating Systems:
es: XLIFF Manager funciona en estos sistemas operativos:

source: Microsoft Windows 10 and 11
es: Microsoft Windows 10 y 11

source: macOS Big Sur (11.0), Monterey (12.0), Ventura (13.0), Sonoma (14.0) and Sequoia (15.0)
es: macOS Big Sur (11.0), macOS Monterey (12.0), Ventura (13.0) Sonoma (14.0) y Sequoia (15.0)

source: Linux for 64-bit x86 (Intel/AMD) processors
es: Linux para procesadores x86 (Intel/AMD) de 64 bits

source: XLIFF Manager installers for Linux are built and tested on Ubuntu 24.04 LTS. The installers are not tested on other distributions.
es: Los instaladores de XLIFF Manager para Linux son creados y probados en Ubuntu 24.04 LTS. Los instaladores no se prueban en otras distribuciones.

source: Computer Assisted Translation (CAT)
es: Traducción asistida por ordenador (TAO)

source: Computer technology application designed to assist human translators in the translation process.
es: Aplicación informática diseñada para ayudar a los traductores humanos en el proceso de traducción.

source: Segmentation Rules eXchange (SRX) is an XML-based standard that was maintained by Localization Industry Standards Association, until it became insolvent in 2011, and then by the {ph0}Globalization and Localization Association{ph1} (GALA).
es: Segmentation Rules eXchange (SRX) es un estándar basado en XML que fue mantenido por la Localization Industry Standards Association, hasta que se declaró insolvente en 2011, y luego por el {ph0}Globalization and Localization Association{ph1} (GALA).

source: SRX provides a common way to describe how to segment text for translation and other language-related processes. It was created when it was realized that TMX was less useful than expected in certain instances due to differences in how tools segment text. SRX is intended to enhance the {ph0}TMX {ph1} standard so that translation memory (TM) data that is exchanged between applications can be used more effectively. Having the segmentation rules available that were used when a TM was created increases the usefulness of the TM data.
es: SRX proporciona una forma estandar de describir cómo segmentar texto para traducción y otros procesos relacionados con el lenguaje. Se creó cuando se hizo evidente que TMX era menos útil de lo esperado en ciertos casos debido a las diferencias en la forma en que las herramientas segmentan el texto. SRX está diseñado para mejorar el estándar {ph0}TMX{ph1} para que los datos de la memoria de traducción (TM) que se intercambian entre aplicaciones se puedan utilizar de manera más efectiva. Tener disponibles las reglas de segmentación que se usaron cuando se creó una TM aumenta la utilidad de los datos de TM.

source: Translation Memory eXchange (TMX) is an open standard originally published by LISA (Localization Industry Standards Association). The purpose of TMX is to allow easier exchange of translation memory data between tools and/or translation vendors with little or no loss of critical data during the process.
es: Translation Memory eXchange (TMX) es un estándar abierto publicado originalmente por LISA (Localization Industry Standards Association). El propósito de TMX es permitir un intercambio más fácil de datos de memorias de traducción entre herramientas y/o proveedores de traducción con poca o ninguna pérdida de datos críticos durante el proceso.

source: XLIFF (XML Localization Interchange File Format) is an open standard developed by {ph0}OASIS{ph1} (Organization for the Advancement of Structured Information Standards). The purpose of this vocabulary is to store localizable data and carry it from one step of the localization process to the other, while allowing interoperability between tools.
es: XLIFF (XML Localization Interchange File Format) es un estándar abierto desarrollado por {ph0}OASIS{ph1} (Organization for the Advancement of Structured Information Standards). El propósito de este vocabulario es almacenar datos localizables y llevarlos de un paso del proceso de localización a otro, al tiempo que permite la interoperabilidad entre herramientas.

source: Character Set
es: Juego de Caracteres

source: A character set (sometimes referred to as code page) is a collection of characters that are associated with a sequence of natural numbers in order to facilitate the storage of text in computers and the transmission of text through telecommunication networks.
es: Un juego de caracteres (a veces denominado página de códigos) es una colección de caracteres que están asociados con una secuencia de números naturales para facilitar el almacenamiento de texto en computadoras y la transmisión de texto a través de redes de telecomunicaciones.

source: Generate Word Counts and Segment Statistics
es: Generar Conteos de Palabras y Estadísticas de Segmentos

source: XLIFF Manager lets you produce an HTML file with word counts and segment status statistics from an {ph0}XLIFF{ph1} document.
es: XLIFF Manager le permite generar un archivo HTML con conteos de palabras y estadísticas de estado de segmentos a partir de un documento {ph0}XLIFF{ph1}.

source: Translation Status Analysis
es: Estado de la Traducción

source: In main menu, select {ph0} {ph1}View{ph2} {ph3}Analyse XLIFF{ph4} {ph5} or click the {ph6}{ph7} Analyse XLIFF{ph8} option on the left panel.
es: En el menú principal, seleccione {ph0} {ph1}Ver{ph2} {ph3}Analizar XLIFF{ph4} {ph5} o haga clic en la opción {ph6}{ph7}Analizar XLIFF{ph8} del panel izquierdo.

source: Type the name and location of the XLIFF file to analyse in the {ph0}XLIFF File{ph1} text box or click the {ph2}Browse...{ph3} button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea analizar en el cuadro de texto {ph0}Archivo XLIFF{ph1} o haga clic en el botón {ph2}Examinar...{ph3} para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the {ph0}Analyse XLIFF{ph1} button.
es: Haga clic en el botón {ph0}Analizar XLIFF{ph1}.

source: XLIFF Manager generates an HTML report in the folder where the XLIFF file is located and its name is the name of the XLIFF plus {ph0}.log.html{ph1}.
es: XLIFF Manager genera un informe HTML en la carpeta donde se encuentra el archivo XLIFF y su nombre es el nombre del XLIFF mas {ph0}.log.html{ph1}.

source: Approve all Segments
es: Aprobar todos los segmentos

source: Set {ph0}approved="true"{ph1} in all {ph2}<trans-unit>{ph3} elements in an XLIFF 1.2 file or set {ph4}state="final"{ph5} in all {ph6}<unit>{ph7} elements of an XLIFF 2.0, 2.1 o 2.2 document.
es: Asignar {ph0}approved="true"{ph1} en todos los elementos {ph2}<trans-unit>{ph3} de un archivo XLIFF 1.2 o asignar {ph4}state="final"{ph5} en todos los elementos {ph6}<unit>{ph7} de un documento XLIFF 2.0, 2.1 o 2.2.

source: Some translation tools do not offer a way to confirm segments at translation time. Use this feature to confirm all segments, so you can select the {ph0}Export Approved Segments as TMX{ph1} option when using the {ph2}Merge XLIFF File{ph3} option.
es: Algunas herramientas de traducción no ofrecen una forma de confirmar segmentos en el momento de la traducción. Utilice esta función para confirmar todos los segmentos, de modo que pueda seleccionar la opción {ph0}Exportar segmentos aprobados como TMX{ph1} cuando utilice la opción {ph2}Combinar XLIFF{ph3}.

source: In main menu, select {ph0} {ph1}View{ph2} {ph3}Translation Tasks{ph4} {ph5} or click the {ph6}{ph7} Translation Tasks{ph8} option on the left panel.
es: En el menú principal, seleccione {ph0} {ph1}Ver{ph2} {ph3}Traducciones{ph4} {ph5} o haga clic en la opción {ph6}{ph7}Traducciones{ph8} del panel izquierdo.

source: Type the name and location of the XLIFF file to process in the {ph0}XLIFF File{ph1} text box or click the {ph2}Browse...{ph3} button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea procesar en el cuadro de texto {ph0}Archivo XLIFF{ph1} o haga clic en el botón {ph2}Examinar...{ph3} para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the {ph0}Approve all Segments{ph1} button.
es: Haga clic en el botón {ph0}Aprobar Todos los Segmentos{ph1}.

source: Copy Source to all Untranslated Segments
es: Copiar origen a destino en todos los segmentos no traducidos

source: Copy the content of {ph0}<source>{ph1} elements to new or existing empty {ph2}<target>{ph3} elements in an XLIFF file.
es: Copiar el contenido de los elementos {ph0}<source>{ph1} a los elementos {ph2}<target>{ph3} que estén vacíos, creando nuevos elementos de ser necesario, en un archivo XLIFF.

source: In main menu, select {ph0} {ph1}View{ph2} {ph3}Translation Tasks{ph4} {ph5} or click the {ph6}{ph7} Translation Tasks{ph8} option on the left panel.
es: En el menú principal, seleccione {ph0} {ph1}Ver{ph2} {ph3}Traducciones{ph4} {ph5} o haga clic en la opción {ph6}{ph7}Traducciones{ph8} del panel izquierdo.

source: Type the name and location of the XLIFF file to process in the {ph0}XLIFF File{ph1} text box or click the {ph2}Browse...{ph3} button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea procesar en el cuadro de texto {ph0}Archivo XLIFF{ph1} o haga clic en el botón {ph2}Examinar...{ph3} para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the {ph0}Copy Source to Target{ph1} button.
es: Haga clic en el botón {ph0}Copiar Origen a Destino{ph1}.

source: Create XLIFF File
es: Crear Archivo XLIFF

source: Use the {ph0}Create XLIFF{ph1} panel to generate an {ph2}XLIFF{ph3} file from a selected document.
es: Utilice el panel {ph0}Crear XLIFF{ph1} para generar un archivo {ph2}XLIFF{ph3} a partir de un documento seleccionado.

source: Create XLIFF File
es: Crear Archivo XLIFF

source: In main menu, select {ph0} {ph1}View{ph2} {ph3}Create XLIFF{ph4} {ph5} or click the {ph6}{ph7} Create XLIFF{ph8} option on the left panel.
es: En el menú principal, seleccione {ph0} {ph1}Ver{ph2} {ph3}Crear XLIFF{ph4} {ph5} o haga clic en la opción {ph6}{ph7}Crear XLIFF{ph8} del panel izquierdo.

source: Type the name and location of the document to convert to XLIFF in the {ph0}Source File{ph1} text box or click the {ph2}Browse...{ph3} button next to it to select a document from the file system.
es: Escriba el nombre y la ubicación del documento que desea convertir a XLIFF en el cuadro de texto {ph0}Archivo de origen{ph1} o haga clic en el botón {ph2}Examinar...{ph3} junto a él para seleccionar un documento del sistema de archivos.

source: If you use the {ph0}Browse...{ph1} button to select a file, the program tries to automatically guess its file type and character set.
es: Si utiliza el botón {ph0}Examinar...{ph1} para seleccionar un archivo, el programa intenta adivinar automáticamente su tipo de archivo y juego de caracteres.

source: Select the language of the document to convert using the {ph0}Source Language{ph1} drop-down list.
es: Seleccione el idioma del documento que desea convertir mediante la lista desplegable {ph0}Idioma de origen{ph1}.

source: Optionally, select the language of the translated document using the {ph0}Target Language{ph1} drop-down list.
es: Opcionalmente, seleccione el idioma del documento traducido mediante la lista desplegable {ph0}Idioma de destino{ph1}.

source: Select or adjust the type of source document using the {ph0}File Type{ph1} drop-down list.
es: Seleccione o ajuste el tipo de documento de origen mediante la lista desplegable {ph0}Tipo de archivo{ph1}.

source: Select or adjust the {ph0}character set{ph1} of the source document using the {ph2}Character Set{ph3} drop-down list.
es: Seleccione o ajuste el {ph0}juego de caracteres{ph1} del documento de origen mediante la lista desplegable {ph2}Juego de caracteres{ph3}.

source: If you are converting a DITA map and need to use a .ditaval file for conditional filtering, enter its path in the {ph0}DITAVAL File{ph1} text box or use the {ph2}Browse...{ph3} button next to it to select a file from the file system.
es: Si está convirtiendo un mapa DITA y necesita utilizar un archivo .ditaval para el filtrado condicional, introduzca su ruta en el cuadro de texto {ph0}Archivo DITAVAL{ph1} o utilice el botón {ph2}Examinar...{ph3} junto a él para seleccionar un archivo del sistema de archivos.

source: Select the {ph0}Ignore Translatable SVG Files{ph1} checkbox if you are converting a DITA map and need to exclude SVG files from the generated XLIFF.
es: Seleccione la opción {ph0}Ignorar archivos SVG traducibles{ph1} si está convirtiendo un mapa DITA y necesita excluir los archivos SVG del XLIFF generado.

source: If you are converting a JSON document and need to use a custom configuration file, enter its name and location in the {ph0}JSON Configuration{ph1} text box or use the {ph2}Browse...{ph3} button next to it to select a file from the file system.
es: Si está convirtiendo un documento JSON y necesita usar un archivo de configuración personalizado, escriba su nombre y ubicación en el cuadro de texto {ph0}Configuración de JSON{ph1} o use el botón {ph2}Examinar...{ph3} junto a él para seleccionar un archivo del sistema de archivos.

source: Information on configuration files for the JSON filter is available at {ph0}https://github.com/rmraya/OpenXLIFF{ph1}
es: En {ph0}https://github.com/rmraya/OpenXLIFF{ph1} hay información sobre los archivos de configuración para el filtro JSON.

source: Use the {ph48}XLIFF Version{ph49} radio buttons to select the version of XLIFF that you want to generate. Use the {ph0}XLIFF Version{ph1} radio buttons to select the version of XLIFF that you want to generate.
es: Utilice los botones de opción {ph48}Versión de XLIFF{ph49} para seleccionar la versión de XLIFF que desea generar. Utilice los botones de opción {ph0}Versión de XLIFF{ph1} para seleccionar la versión de XLIFF que desea generar.

source: The program generates XLIFF 2.0 by default. The program generates XLIFF 2.1 by default.
es: El programa genera XLIFF 2.0 de forma predeterminada. El programa genera XLIFF 2.1 de forma predeterminada.

source: Select the {ph48}Paragraph Segmentation{ph49} checkbox if you want source text to be segmented at paragraph level. Select the {ph0}Paragraph Segmentation{ph1} checkbox if you want source text to be segmented at paragraph level.
es: Seleccione la opción {ph48}Segmentar por párrafos{ph49} si desea que el texto de origen se segmente a nivel de párrafo. Seleccione la opción {ph0}Segmentar por párrafos{ph1} si desea que el texto de origen se segmente a nivel de párrafo.

source: The program uses sentence-level segmentation by default. You can select the default {ph0}SRX{ph1} file used for segmentation in the {ph2}Settings{ph3} dialog.
es: El programa utiliza la segmentación a nivel de oración en fprma predeterminada. Puede seleccionar el archivo {ph0}SRX{ph1} utilizado para la segmentación en el cuadro de diálogo {ph2}Configuración{ph3}.

source: Select the {ph0}Embed Skeleton{ph1} checkbox if you want the skeleton file to be inserted in the generated XLIFF.
es: Seleccione la opción {ph0}Incrustar esqueleto{ph1} si desea que el archivo esqueleto se inserte en el XLIFF generado.

source: The program generates a separated skeleton file in the folder defined in {ph0}Settings{ph1} dialog. An embedded skeleton allows merging the XLIFF file in any computer, not just the one where the XLIFF was generated.
es: El programa genera un archivo esqueleto separado en la carpeta definida en el cuadro de diálogo {ph0}Configuración{ph1}. Un esqueleto incrustado permite combinar el archivo XLIFF en cualquier computadora, no solo en aquella donde se generó el archivo XLIFF.

source: Click the {ph0}Create XLIFF{ph1} button.
es: Haga clic en el botón {ph0}Crear XLIFF{ph1}.
