Repository: rmraya/XLIFFManager
Catalog: docs/XLIFF/xliffmanager_*.ditamap.xlf
Languages: es

source: The program generates an XLIFF file and the corresponding skeleton.
es: El programa genera un archivo XLIFF y el esqueleto correspondiente.

source: Settings
es: Configuración

source: Use the {ph0}Settings{ph1} dialog to set the default languages used by the application and to configure the main XML catalog and default folder used to store skeletons when creating {ph2}XLIFF{ph3} files.
es: Utilice el cuadro de diálogo {ph0}Configuración{ph1} para establecer los idiomas predeterminados utilizados por la aplicación y para configurar el catálogo XML principal y la carpeta utilizada para almacenar esqueletos al crear archivos {ph2}XLIFF{ph3}.

source: In main menu, select {ph0} {ph1}Settings{ph2} {ph3} ({ph4} {ph5}XLIFF Manager{ph6} {ph7}Preferences{ph8} {ph9} on macOS) or click the {ph10}
es: En el menú principal, seleccione {ph0} {ph1}Configuración{ph2} {ph3} ({ph4} {ph5}XLIFF Manager{ph6} {ph7}Preferencias...{ph8} {ph9} en macOS) o haga clic en la opción {ph10}

source: Settings{ph0} option or on the left panel.
es: Configuración{ph0} del panel izquierdo.

source: The following dialog appears:
es: Aparece el siguiente cuadro de diálogo:

source: {ph0}Settings{ph1} dialog
es: Cuadro de diálogo {ph0}Configuración{ph1}

source: Select the apropriate default source and target languages to use when creating XLIFF files.
es: Seleccione los idiomas de origen y destino predeterminados apropiados que desea utilizar al crear archivos XLIFF.

source: If you wish to use a custom catalog for XML files, enter its location in the {ph0}System Catalog{ph1} text box or use the corresponding {ph2}Browse...{ph3} button to select it from the file system.
es: Si desea utilizar un catálogo personalizado para archivos XML, introduzca su ubicación en el cuadro de texto {ph0}Catálogo del sistema{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionarlo del sistema de archivos.

source: If you wish to change the folder where skeleton files are saved, enter the folder name in the {ph0}Skeletons Folder{ph1} text box or use the {ph2}Browse...{ph3} button to select the new location in the file system.
es: Si desea cambiar la carpeta donde se guardan los archivos esqueleto, introduzca el nombre de la carpeta en el cuadro de texto {ph0}Carpeta de esqueletos{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionar la nueva ubicación en el sistema de archivos.

source: To use a custom {ph0}SRX{ph1} file when creating XLIFF files, enter its location in the {ph2}Default SRX File{ph3} text box or use the {ph4}Browse...{ph5} button to select it from the file system.
es: Para utilizar un archivo {ph0}SRX{ph1} personalizado al crear archivos XLIFF, introduzca su ubicación en el cuadro de texto {ph2}Archivo SRX predeterminado{ph3} o utilice el botón {ph4}Examinar...{ph5} para seleccionarlo del sistema de archivos.

source: Use the {ph0}Application Language{ph1} drop-down to select the language used in XLIFF Manager graphical user interface.
es: Utilice el menú desplegable {ph0}Idioma de la aplicación{ph1} para seleccionar el idioma utilizado en la interfaz gráfica de usuario de XLIFF Manager.

source: Changes to the application language will take effect after you restart the program.
es: Los cambios en el idioma de la aplicación surtirán efecto después de reiniciar el programa.

source: Use the {ph0}Theme{ph1} drop-down to select the colors used in the graphical user interface. Available options are:
es: Utilice el menú desplegable {ph0}Tema{ph1} para seleccionar los colores utilizados en la interfaz gráfica de usuario. Las opciones disponibles son:

source: {ph0}System Default{ph1}: automatically selects Dark or Light colors according to the preferences set in the operating system.
es: {ph0}Predeterminado del sistema{ph1}: selecciona automáticamente los colores oscuros o claros según las preferencias establecidas en el sistema operativo.

source: {ph0}Dark{ph1}: Uses dark background with white text.
es: {ph0}Oscuro{ph1}: utiliza fondo oscuro con texto blanco.

source: {ph0}Light{ph1}: Uses light grey background with dark text
es: {ph0}Claro{ph1}: utiliza fondo gris claro con texto oscuro

source: Click the {ph0}Save Settings{ph1} button.
es: Haga clic en el botón {ph0}Guardar Configuración{ph1}.

source: Merge XLIFF File
es: Combinar Archivo XLIFF

source: Use the {ph0}Merge XLIFF{ph1} panel to convert an {ph2}XLIFF{ph3} file to original format.
es: Utilice el panel {ph0}Combinar XLIFF{ph1} para convertir un archivo {ph2}XLIFF{ph3} al formato original.

source: XLIFF Manager can only merge XLIFF files that it generated or XLIFF files created with other tools that use {ph0}OpenXLIFF Filters{ph1}.
es: XLIFF Manager solo puede combinar archivos XLIFF que generó o archivos XLIFF creados con otras herramientas que utilizan {ph0}OpenXLIFF Filters{ph1}.

source: Merge XLIFF File
es: Combinar Archivo XLIFF

source: In main menu, select {ph0} {ph1}View{ph2} {ph3}Merge XLIFF{ph4} {ph5} or click the {ph6}{ph7} Merge XLIFF{ph8} option on the left panel.
es: En el menú principal, seleccione {ph0} {ph1}Ver{ph2} {ph3}Combinar XLIFF{ph4} {ph5} o haga clic en la opción {ph6}{ph7}Combinar XLIFF{ph8} del panel izquierdo.

source: Type the name and location of the XLIFF file to merge in the {ph0}XLIFF File{ph1} text box or click the {ph2}Browse...{ph3} button next to it to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF a combinar en el cuadro de texto {ph0}Archivo XLIFF{ph1} o haga clic en el botón {ph2}Examinar...{ph3} para seleccionar un archivo XLIFF del sistema de archivos.

source: If you use the {ph0}Browse...{ph1} button to locate the XLIFF file, the program tries to automatically generate a suitable target file or folder.
es: Si utiliza el botón {ph0}Examinar...{ph1} para localizar el archivo XLIFF, el programa intenta generar automáticamente un archivo o carpeta de destino adecuado.

source: Type the name of the translated file or folder for translated documents in the {ph0}Target File/Folder{ph1} text box or click the {ph2}Browse...{ph3} button next to it to select a file or folder.
es: Escriba el nombre del archivo o carpeta para los documentos traducidos en el cuadro de texto {ph0}Archivo/carpeta de destino{ph1} o haga clic en el botón {ph2}Examinar...{ph3} junto a él para seleccionar un archivo o carpeta.

source: If the XLIFF file contains multiple documents inside, a folder is required to place all translated files in it. This is usually the case when the XLIFF was created from a DITA Map.
es: Si el archivo XLIFF contiene varios documentos en su interior, se requiere una carpeta para guardar los documentos traducidos. Este suele ser el caso cuando el archivo XLIFF se creó a partir de un mapa DITA.

source: Select the {ph0}Accept Unapproved Segments{ph1} checkbox if you want to consider all segments as translated, even when the {ph2}approved{ph3} attribute is not set to "yes".
es: Seleccione la opción {ph0}Aceptar segmentos no aprobados{ph1} si desea considerar todos los segmentos como traducidos, incluso cuando el atributo "{ph2}approved{ph3}" no esté establecido en "yes".

source: Select the {ph0}Export Approved Segments as TMX{ph1} checkbox if you want to generate a {ph2}TMX{ph3} file from the XLIFF file.
es: Seleccione la opción {ph0}Exportar segmentos aprobados como TMX{ph1} si desea generar un archivo {ph2}TMX{ph3} a partir del archivo XLIFF.

source: Select the {ph0}Open Translated File/Folder After Merging{ph1} checkbox if you want to automatically open the translated document or folder after a successful merge operation.
es: Seleccione la opción {ph0}Abrir archivo/carpeta traducido después de combinar{ph1} si desea abrir automáticamente el documento o carpeta traducidos después de una operación de combinación correcta.

source: Click the {ph0}Merge XLIFF{ph1} button.
es: Haga clic en el botón {ph0}Combinar XLIFF{ph1}.

source: XLIFF Manager merges the indicated file.
es: XLIFF Manager combina el archivo indicado.

source: Pseudo-Translate Untranslated Segments
es: Pseudo-traducir Segmentos no Traducidos

source: Copy the content of {ph0}<source>{ph1} elements to new or existing empty {ph2}<target>{ph3} elements in an XLIFF file, replacing all regular vowels with an accented version (e.g.: e => é).
es: Copie el contenido de los elementos {ph0}<source>{ph1} a los correspondientes elementos {ph2}<target>{ph3} vacíos o no traducidos de un archivo XLIFF, reemplazando todas las vocales regulares con una versión acentuada (por ejemplo: e = > é).

source: Use this method to generate a fake translation that you can use to test the {ph0}Merge XLIFF File{ph1} process. After making sure that Merge runs successfully, you can use the {ph2}Remove all Targets{ph3} option to clean your XLIFF file.
es: Utilice este método para generar una traducción falsa que puede utilizar para probar el proceso {ph0}Combinar XLIFF{ph1}. Después de asegurarse de que la combinación se ejecuta correctamente, puede usar la opción {ph2}Eliminar Todas las Traducciones{ph3} para limpiar el archivo XLIFF.

source: Click the {ph0}Pseudo-Translate{ph1} button.
es: Haga clic en el botón {ph0}Pseudo-Traducir{ph1}.

source: Remove all Targets
es: Eliminar todas las traducciones

source: Use this feature to remove all {ph0}<target>{ph1} elements from your XLIFF file.
es: Utilice esta función para eliminar todos los elementos {ph0}<target>{ph1} del archivo XLIFF.

source: Click the {ph0}Remove all Targets{ph1} button.
es: Haga clic en el botón {ph0}Eliminar Todas las Traducciones{ph1}.

source: Validate XLIFF
es: Validar XLIFF

source: XLIFF Manager can validate {ph0}XLIFF{ph1} 1.0, 1.1, 1.2 and 2.0.
es: XLIFF Manager puede validar {ph0}XLIFF{ph1} 1.0, 1.1, 1.2 y 2.0.

source: Validating XLIFF against XML grammars (DTD or XML Schemas) is not enough. XML Schema validation does not detect the use of duplicated 'id' attributes, wrong language codes and other constraints written in the different XLIFF specifications.
es: Validar XLIFF con gramáticas XML (DTD o esquemas XML) no es suficiente. La validación usando esquema XML no detecta el uso de atributos 'id' duplicados, códigos de idioma incorrectos y otras restricciones escritas en las diferentes especificaciones XLIFF.

source: In addition to validating all XLIFF 2.0 modules using XML Schema validation, extra validation is performed for XLIFF 2.0 Core and for Metadata, Matches and Glossary modules.
es: Además de validar todos los módulos XLIFF 2.0 mediante la validación de esquemas XML, se realiza una validación adicional para XLIFF 2.0 Core y para los módulos Metadata, Matches y Glossary.

source: Validate XLIFF File
es: Validar Archivo XLIFF

source: In main menu, select {ph0} {ph1}View{ph2} {ph3}Validate XLIFF{ph4} {ph5} or click the {ph6}{ph7} Validate XLIFF{ph8} option on the left panel.
es: En el menú principal, seleccione {ph0} {ph1}Ver{ph2} {ph3}Validar XLIFF{ph4} {ph5} o haga clic en la opción {ph6}{ph7}Validar XLIFF{ph8} del panel izquierdo.

source: Type the name and location of the XLIFF file to validate in the {ph0}XLIFF File{ph1} text box or click the {ph2}Browse...{ph3} button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF a validar en el cuadro de texto {ph0}Archivo XLIFF{ph1} o haga clic en el botón {ph2}Examinar...{ph3} para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the {ph0}Validate XLIFF{ph1} button.
es: Haga clic en el botón {ph0}Validar XLIFF{ph1}.

source: XLIFF Manager validates the indicated file.
es: XLIFF Manager valida el archivo indicado.

source: {ph0}XLIFF Manager User Guide{ph1} {ph2} {ph3} {ph4} {ph5}Copyright © 2018 - 2025 Maxprograms{ph6}
es: {ph0}Guía del Usuario de XLIFF Manager{ph1} {ph2} {ph3} {ph4} {ph5}Derechos de autor © 2018 - 2025 Maxprograms{ph6}

source: Creating and Merging XLIFF Files
es: Crear y Combinar Archivos XLIFF
